---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.GridChainSketchFailures
source: html/ab10b1e1-dae9-1627-76a6-5a75a8c866db.htm
---
# BuiltInFailures.GridChainSketchFailures Properties

GridChain sketch contains a closed loop.